brew "bat"
brew "chruby"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "fortune"
brew "fzf"
brew "git"
brew "git-delta"
brew "gpg"
brew "grex"
brew "htop-osx"
brew "hub"
brew "jq"
brew "magic-wormhole"
brew "mosh"
brew "nodenv"
brew "ponysay"
brew "postgresql", restart_service: :changed
brew "reattach-to-user-namespace"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "ruby-install"
brew "source-highlight"
brew "ssh-copy-id"
brew "tmux"
brew "wget"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

tap "eth-p/software"
brew "eth-p/software/bat-extras"

tap "heroku/brew"
brew "heroku/brew/heroku"

tap "indirect/tap"
brew "indirect/tap/bpb"
brew "indirect/tap/horse_fortunes"

tap "nodenv/nodenv"
brew "nodenv/nodenv/nodenv-package-json-engine"

tap "romkatv/powerlevel10k"
brew "romkatv/powerlevel10k/powerlevel10k"

tap "puma/puma"
brew "puma/puma/puma-dev"

tap "smudge/smudge"
brew "smudge/smudge/nightlight"

tap "claui/public"
brew "claui/public/wishfish"

cask "1password"
cask "abyssoft-teleport"
cask "acorn"
cask "alfred"
cask "backblaze"
cask "bartender"
cask "bettertouchtool"
cask "calibre"
cask "daisydisk"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "fantastical"
cask "firefox"
cask "fork"
cask "google-chrome"
cask "google-cloud-sdk"
cask "hammerspoon"
cask "handbrake"
cask "hookshot"
cask "imageoptim"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "kindle"
cask "little-snitch"
cask "macvim"
cask "marked"
cask "menumeters"
cask "name-mangler"
cask "notion"
cask "omnifocus"
cask "omnigraffle"
cask "screens"
cask "sequel-pro"
cask "skype"
cask "slack"
cask "soundsource"
cask "steam"
cask "superduper"
cask "textmate"
cask "transmit"
cask "visual-studio-code"
cask "vlc"

cask "homebrew/cask-versions/visual-studio-code-insiders"
cask "indirect/tap/font-menlo-nerd-font-p10k"
cask "indirect/tap/font-sf-mono-nerd-font"

mas "1Blocker", id: 1365531024
mas "Apple Developer", id: 640199958
mas "Boop", id: 1518425043
mas "Day One", id: 1055511498
mas "Due", id: 524373870
mas "GIF Brewery", id: 1081413713
mas "Gapplin", id: 768053424
mas "Harvest", id: 506189836
mas "Hush Nag Blocker", id: 1544743900
mas "Instapaper Save for Safari", id: 1481302432
mas "Keys for Safari", id: 1494642810
mas "Linea Link", id: 1233368267
mas "Meeter", id: 1510445899
mas "Notion Web Clipper", id: 1559269364
mas "Omsave for Safari", id: 1514795049
mas "Paprika", id: 1303222628
mas "PiPifier - PiP for nearly every video", id: 1160374471
mas "Peakhour", id: 1241445112
mas "Reeder 5", id: 1529448980
mas "Shareful", id: 1522267256
mas "Simplenote", id: 692867256
mas "Sip", id: 507257563
mas "Soulver", id: 413965349
mas "Tailscale", id: 1475387142
mas "Tampermonkey", id: 1482490089
mas "The Unarchiver", id: 425424353
mas "Toast for Safari", id: 1465707487
mas "ToothFairy", id: 1191449274
mas "Tweetbot", id: 1384080005
mas "Twitter", id: 1482454543
mas "Ulysses", id: 1225570693
mas "XScope", id: 889428659
mas "Xcode", id: 497799835
