tap "indirect/tap"
tap "heroku/brew"
tap "nodenv/nodenv"

brew "autojump"
brew "bash-completion"
brew "chruby"
brew "ffmpeg"
brew "fortune"
brew "fzf"
brew "git"
brew "gpg"
brew "heroku/brew/heroku"
brew "htop-osx"
brew "hub"
brew "indirect/tap/bpb"
brew "indirect/tap/horse_fortunes"
brew "magic-wormhole"
brew "nodenv"
brew "nodenv/nodenv/nodenv-package-json-engine"
brew "ponysay"
brew "postgresql", restart_service: :changed
brew "reattach-to-user-namespace"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "ruby-install"
brew "source-highlight"
brew "ssh-copy-id"
brew "tmux"
brew "tree"
brew "wget"

cask "1password"
cask "acorn"
cask "aerial"
cask "alfred"
cask "backblaze"
cask "bartender"
cask "bettertouchtool"
cask "cloudapp"
cask "daisydisk"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "fantastical"
cask "firefox"
cask "google-chrome"
cask "hammerspoon"
cask "handbrake"
cask "harvest"
cask "imageoptim"
cask "indirect/tap/gitx-gitx"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "kindle"
cask "little-snitch"
cask "macvim"
cask "marked"
cask "menumeters"
cask "name-mangler"
cask "omnifocus"
cask "omnigraffle"
cask "screens"
cask "sequel-pro"
cask "skype"
cask "slack"
cask "soundsource"
cask "steam"
cask "superduper"
cask "textmate"
cask "transmit"
cask "vlc"

mas "Day One", id: 1055511498
mas "Due", id: 524373870
mas "GIF Brewery", id: 1081413713
mas "Gapplin", id: 768053424
mas "Reeder", id: 1449412482
mas "Simplenote", id: 692867256
mas "Sip", id: 507257563
mas "Soulver", id: 413965349
mas "The Unarchiver", id: 425424353
mas "Tweetbot", id: 557168941
mas "Ulysses", id: 623795237
mas "XScope", id: 889428659
