brew "age"
brew "atuin", restart_service: :changed
brew "aws-iam-authenticator"
brew "awscli"
brew "bat"
brew "chezmoi"
brew "chruby", args: %w[HEAD]
brew "dnscontrol"
brew "dockutil"
brew "doggo"
brew "dust"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "flyctl"
brew "fortune"
brew "fzf"
brew "fzy"
brew "gh"
brew "ghq"
brew "git-delta"
brew "git"
brew "gpg"
brew "grex"
brew "handbrake"
brew "htop"
brew "jj"
brew "jjui"
brew "jq"
brew "kubectl"
brew "magic-wormhole"
brew "mosh"
brew "nodenv"
brew "overmind"
brew "pam-reattach"
brew "pipx"
brew "ponysay"
brew "postgresql@16", restart_service: :changed
brew "prettyping"
brew "reattach-to-user-namespace"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "rsync"
brew "ruby-install"
brew "source-highlight"
brew "ssh-copy-id"
brew "tailscale"
brew "tmux"
brew "uv"
brew "wget"
brew "xq"
brew "yt-dlp"
brew "zoxide"
brew "zsh-completions"

tap "eth-p/software"
brew "eth-p/software/bat-extras"

tap "heroku/brew"
brew "heroku/brew/heroku"

tap "indirect/tap"
brew "indirect/tap/bpb"
brew "indirect/tap/horse_fortunes"
brew "indirect/tap/weird_fortunes"
brew "indirect/tap/utility_limb_fortunes"
brew "indirect/tap/wishfish"

tap "nodenv/nodenv"
brew "nodenv/nodenv/nodenv-package-json-engine"

tap "puma/puma"
brew "puma/puma/puma-dev"

tap "smudge/smudge"
brew "smudge/smudge/nightlight"

tap "keith/formulae"
brew "keith/formulae/git-pile"

tap "skatkov/tap"
brew "skatkov/tap/poshtui"

cask "1password-cli"
cask "1password"
cask "acorn"
cask "alfred"
cask "avifquicklook"
cask "backblaze"
cask "backuploupe"
cask "calibre"
cask "daisydisk"
cask "dash"
cask "discord"
# cask "dymo-connect"
cask "fantastical"
cask "figma"
cask "firefox"
cask "font-monaspace"
cask "font-new-york"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-pro"
cask "fork"
cask "google-chrome"
cask "hammerspoon"
cask "handbrake"
cask "jordanbaird-ice"
cask "jumpshare"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "launchcontrol"
cask "linear-linear"
cask "little-snitch"
cask "macvim"
cask "macwhisper"
cask "maestral"
cask "marked"
cask "mountain-duck"
cask "name-mangler"
cask "notion"
cask "nova"
cask "omnifocus"
cask "omnigraffle"
cask "orbstack"
cask "playdate-simulator"
cask "qladdict"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlswift"
cask "qlvideo"
cask "qlzipinfo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicknfo"
cask "raindropio"
cask "rapidapi"
cask "rectangle-pro"
cask "retcon"
cask "screens"
cask "secretive"
cask "slack"
cask "stats"
cask "steam"
cask "superduper"
cask "suspicious-package"
cask "tailscale"
cask "textmate"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "webpquicklook"
cask "zoom"
cask "zoomin"

cask "indirect/tap/font-menlo-nerd-font"
cask "indirect/tap/font-sf-mono-nerd-font"
cask "indirect/tap/ghostty"
cask "indirect/tap/glance", args: { no_quarantine: true }
cask "indirect/tap/sky"

{{- if .server }}
# Server-specific
brew "caddy"
brew "indirect/tap/cronitor"
brew "transmission-cli", restart_service: :changed

cask "fujitsu-scansnap-home"
cask "indirect/tap/lidarr", args: { no_quarantine: true }
cask "indirect/tap/radarr", args: { no_quarantine: true }
cask "plex-media-server"
cask "sabnzbd", args: { no_quarantine: true }
cask "softraid"
cask "sonarr", args: { no_quarantine: true }
{{- end }}
