brew "aws-iam-authenticator"
brew "awscli"
brew "bat"
brew "chezmoi"
brew "chruby"
brew "dust"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "flyctl"
brew "fortune"
brew "fzf"
brew "fzy"
brew "gh"
brew "git"
brew "git-delta"
brew "gpg"
brew "grex"
brew "htop"
brew "hub"
brew "jq"
brew "kubectl"
brew "magic-wormhole"
brew "mosh"
brew "nodenv"
brew "ponysay"
brew "postgresql", restart_service: :changed
brew "prettyping"
brew "reattach-to-user-namespace"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "rsync"
brew "ruby-install"
brew "source-highlight"
brew "ssh-copy-id"
brew "tmux"
brew "wget"
brew "yt-dlp"
brew "zoxide"

tap "eth-p/software"
brew "eth-p/software/bat-extras"

tap "heroku/brew"
brew "heroku/brew/heroku"

tap "indirect/tap"
brew "indirect/tap/bpb"
brew "indirect/tap/horse_fortunes"
brew "indirect/tap/wishfish"

tap "nodenv/nodenv"
brew "nodenv/nodenv/nodenv-package-json-engine"

tap "puma/puma"
brew "puma/puma/puma-dev"

tap "smudge/smudge"
brew "smudge/smudge/nightlight"

cask "1password"
cask "1password-cli"
cask "acorn"
cask "alfred"
cask "backblaze"
cask "backuploupe"
cask "bartender"
cask "calibre"
cask "daisydisk"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "fantastical"
cask "firefox"
cask "fork"
cask "google-chrome"
cask "google-cloud-sdk"
cask "hammerspoon"
cask "handbrake"
cask "jumpshare"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "kindle"
cask "kitty"
cask "launchcontrol"
cask "little-snitch"
cask "macvim"
cask "marked"
cask "menumeters"
cask "name-mangler"
cask "notion"
cask "nova"
cask "omnifocus"
cask "omnigraffle"
cask "paw"
cask "playdate-simulator"
cask "rectangle-pro"
cask "screens"
cask "sizzy"
cask "slack"
cask "soundsource"
cask "steam"
cask "superduper"
cask "suspicious-package"
cask "textmate"
cask "vimr"
cask "visual-studio-code"
cask "vlc"

cask "indirect/tap/font-menlo-nerd-font-p10k"
cask "indirect/tap/font-sf-mono-nerd-font"
cask "indirect/tap/kitty-icon"

mas "1Blocker", id: 1365531024
mas "Apple Developer", id: 640199958
mas "Baking Soda - Tube Cleaner", id: 1601151613
mas "Day One", id: 1055511498
mas "Deliveries", id: 290986013
mas "Due", id: 524373870
mas "GIF Brewery", id: 1081413713
mas "Gapplin", id: 768053424
mas "Harvest", id: 506189836
mas "Hush Nag Blocker", id: 1544743900
mas "Instapaper Save for Safari", id: 1481302432
mas "Keys for Safari", id: 1494642810
mas "Notion Web Clipper", id: 1559269364
mas "Omsave for Safari", id: 1514795049
mas "Paprika", id: 1303222628
mas "Peakhour", id: 1241445112
mas "PiPifier - PiP for nearly every video", id: 1160374471
mas "Reeder 5", id: 1529448980
mas "Shareful", id: 1522267256
mas "Simplenote", id: 692867256
mas "Sip", id: 507257563
mas "Soulver", id: 413965349
mas "Tailscale", id: 1475387142
mas "Tampermonkey", id: 1482490089
mas "The Unarchiver", id: 425424353
mas "ToothFairy", id: 1191449274
mas "Tweetbot", id: 1384080005
mas "Twitter", id: 1482454543
mas "Ulysses", id: 1225570693
mas "Vinegar - Tube Cleaner", id: 1591303229
mas "XScope", id: 889428659
mas "Xcode", id: 497799835

{{- if .server }}
# Server-specific entries
brew "certbot"
brew "indirect/tap/cronitor"
brew "nginx", restart_service: :changed

cask "handbrake"
cask "indirect/tap/lidarr", args: { no_quarantine: true }
cask "indirect/tap/radarr", args: { no_quarantine: true }
cask "plex-media-server"
cask "sabnzbd", args: { no_quarantine: true }
cask "softraid"
cask "sonarr", args: { no_quarantine: true }
cask "transmission"

tap "homebrew/cask-drivers"
cask "homebrew/cask-drivers/fujitsu-scansnap-manager-ix500"
{{- end }}
